news.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-24 Fri 10:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>News</title>
<meta name="author" content="Alex Wood" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg-no-toc.css"/>

</head>
<body>
<div id="preamble" class="status">
<div id="top-menu">
<ul>
<li><a href="index.html">Clasp</a>
<ul>
<li><a href="news.html">News</a></li>
<li><a href="download.html">Download</a></li>
</ul></li>
<li><a href="index.html">Doc</a>
<ul>
<li><a href="license.html">License</a></li>
<li><a href="manual.html">Manual</a></li>
<li><a href="building.html">Building</a></li>
<li><a href="clbind-doc.html">Exposing C++ Libraries</a></li>
</ul></li>
<li><a href="index.html">Misc</a>
<ul>
<li><a href="community.html">Community</a></li>
<li><a href="projects.html">Projects</a></li>
<li><a href="media.html">Media</a></li>
<li><a href="acknowlegements.html">Acknowledgements</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="content" class="content">
<h1 class="title">News</h1>

<div id="outline-container-org51f9dce" class="outline-2">
<h2 id="org51f9dce"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-01-21 Tue&gt; </span></span> Version 2.7.0 (LLVM15-19)</h2>
<div class="outline-text-2" id="text-org51f9dce">
</div>
<div id="outline-container-orge20fcf8" class="outline-3">
<h3 id="orge20fcf8">Added</h3>
<div class="outline-text-3" id="text-orge20fcf8">
<ul class="org-ul">
<li>Package lock support, based on SBCL's. Currently ignores local
bindings. Thanks @bumblingbats.</li>
<li>Add support for 80-bit and 128-bit LONG-FLOAT. Extended precision
LONG-FLOAT is available on amd64 and non-Apple arm64 platforms. It
is automatically detected and enabled.</li>
<li>LLVM19 support.</li>
<li>Interrupts have now been organized into a coherent interface.
Clasp will signal conditions of type MP:INTERRUPT at opportune
times, and these conditions can be handled like any others.</li>
<li>Extensions to Clasp and CANDO can now be built against an installed
Clasp implementation and dynamically loaded. For an example see
<a href="https://github.com/clasp-developers/clasp-hello-world">clasp-hello-world</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-org4ec9c04" class="outline-3">
<h3 id="org4ec9c04">Changed</h3>
<div class="outline-text-3" id="text-org4ec9c04">
<ul class="org-ul">
<li>Floating point exceptions FE<sub>INVALID</sub>, FE<sub>OVERFLOW</sub> and FE<sub>DIVBYZERO</sub>
now signal the corresponding lisp errors by default.</li>
</ul>
</div>
</div>

<div id="outline-container-org3b4c44c" class="outline-3">
<h3 id="org3b4c44c">Fixed</h3>
<div class="outline-text-3" id="text-org3b4c44c">
<ul class="org-ul">
<li>Pathnames and filesystem operations support Unicode (<a href="https://github.com/clasp-developers/clasp/issues/1595">#1595</a>).</li>
<li>Package names support Unicode (<a href="https://github.com/clasp-developers/clasp/issues/1596">#1596</a>).</li>
<li>Clasp threads can now be more reliably interrupted while they are
blocking (e.g. waiting to grab a mutex, or for input).</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgdf6d3b1" class="outline-2">
<h2 id="orgdf6d3b1"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-06-03 Mon&gt; </span></span> Version 2.6.0 (LLVM15-18)</h2>
<div class="outline-text-2" id="text-orgdf6d3b1">
</div>
<div id="outline-container-org5cc2c02" class="outline-3">
<h3 id="org5cc2c02">Added</h3>
<div class="outline-text-3" id="text-org5cc2c02">
<ul class="org-ul">
<li>LLVM18 support.</li>
</ul>
</div>
</div>

<div id="outline-container-org8f09aca" class="outline-3">
<h3 id="org8f09aca">Changed</h3>
<div class="outline-text-3" id="text-org8f09aca">
<ul class="org-ul">
<li>Exit with error code when unknown option is present on command line.</li>
<li>EVAL now uses bytecode, improving evaluation speed.</li>
<li>Bytecode is now simpler for functions with &amp;rest parameters, as well
as functions that close over arguments.</li>
</ul>
</div>
</div>

<div id="outline-container-org5c4aa97" class="outline-3">
<h3 id="org5c4aa97">Fixed</h3>
<div class="outline-text-3" id="text-org5c4aa97">
<ul class="org-ul">
<li>Avoid inserting fill newlines after newline format directive in
logical block format directive.</li>
<li>Don't buffer overrun when encoding UCS-4 streams.</li>
<li>The bytecode system can properly handle functions with more than
255 keyword parameters.</li>
<li>Bytecode FASLs can contain multidimensional arrays specialized to
sub-byte integer types.</li>
<li>Avoid a double free when translating <code>const char*</code> arguments in the
C++ bridge.</li>
<li><code>macroexpand</code> does not ignore shadowing function bindings (<a href="https://github.com/clasp-developers/clasp/issues/1556">#1556</a>).</li>
<li>BTB compiler can handle closure variables deleted by optimization.</li>
<li><code>(setf elt)</code> calls <code>(setf sequence:elt)</code> properly on extended
sequences.</li>
<li>BTB compiler handles non-constant load-time-values.</li>
<li>When <code>set-macro-character</code> is given a non-function, it signals an
error without breaking the readtable.</li>
</ul>
</div>
</div>

<div id="outline-container-org63e847e" class="outline-3">
<h3 id="org63e847e">Optimized</h3>
<div class="outline-text-3" id="text-org63e847e">
<ul class="org-ul">
<li>Single dispatch generic functions don't perform redundant argument
count checks.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org079dbb0" class="outline-2">
<h2 id="org079dbb0"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-01-01 Mon&gt; </span></span> Version 2.5.0 (LLVM15-17)</h2>
<div class="outline-text-2" id="text-org079dbb0">
</div>
<div id="outline-container-org97bb8a1" class="outline-3">
<h3 id="org97bb8a1">Added</h3>
<div class="outline-text-3" id="text-org97bb8a1">
<ul class="org-ul">
<li>New module named "gray-streams" which makes it possible to
initialize the Gray stream protocol without calls to internal
functions.</li>
<li>New build mode <code>:bytecode-faso</code> which builds the kernel as native
code (FASO) while the bytecode compiler is active.</li>
<li>Generic <code>gray:stream-file-length</code> which implements <code>cl:file-length</code>
for Gray streams.</li>
<li>Generic versions of <code>cl:pathname</code> and <code>cl:truename</code>, both of which
are available after the Gray stream modules is required.</li>
<li>Generic <code>(setf gray:stream-element-type)</code>,
<code>gray:stream-external-format</code>, and 
<code>(setf gray:stream-external-format)</code> for basic support of bivalent 
streams.</li>
<li>Generic <code>gray:stream-file-string-length</code> which implements
<code>cl:file-string-length</code> for Gray streams.</li>
<li>The bytecode compiler warns about unused variables.</li>
</ul>
</div>
</div>

<div id="outline-container-org7c832a4" class="outline-3">
<h3 id="org7c832a4">Changed</h3>
<div class="outline-text-3" id="text-org7c832a4">
<ul class="org-ul">
<li><code>cl:format</code> and <code>pprint</code> now respect the value returned by
<code>gray:stream-line-length</code>.</li>
<li><code>cl:close</code> now uses the <code>:abort</code> argument to decide what to do with
the resulting file. If <code>:abort</code> is non-NIL and the file was created
as a result of <code>:if-does-not-exist :create</code> then the file is
deleted. If <code>:abort</code> is non-NIL, there was an existing file and
<code>:if-exists</code> is either <code>:supersede</code> or <code>:rename-and-delete</code> then the
original file is restored.</li>
</ul>
</div>
</div>

<div id="outline-container-orgafbda44" class="outline-3">
<h3 id="orgafbda44">Removed</h3>
<div class="outline-text-3" id="text-orgafbda44">
<ul class="org-ul">
<li>Obsolete <code>:object</code>, <code>:ll</code>, <code>:bc</code>, and <code>:fasl</code> build modes.</li>
</ul>
</div>
</div>

<div id="outline-container-org5d9d3e6" class="outline-3">
<h3 id="org5d9d3e6">Fixed</h3>
<div class="outline-text-3" id="text-org5d9d3e6">
<ul class="org-ul">
<li><code>cl:read-line</code> so it correctly returns lines that end with EOF.</li>
<li><code>cl:read-byte</code> so it respects the <code>eof-error-p</code> and <code>eof-value</code>
arguments for Gray streams.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org55641e1" class="outline-2">
<h2 id="org55641e1"><span class="timestamp-wrapper"><span class="timestamp">&lt;2023-10-01 Sun&gt; </span></span> Version 2.4.0 (LLVM15-17)</h2>
<div class="outline-text-2" id="text-org55641e1">
</div>
<div id="outline-container-org61d7519" class="outline-3">
<h3 id="org61d7519">Added</h3>
<div class="outline-text-3" id="text-org61d7519">
<ul class="org-ul">
<li>Bytecode stores source location info for debugging.</li>
<li>Bytecode stores variable info, so that variables can be viewed in
the debugger.</li>
<li>The bytecode compiler tracks source positions for error reporting.</li>
<li>Circle detection for load forms in bytecode FASL.</li>
<li>Bytecode functions can be compiled directly into native code with
<code>cl:compile</code> (experimental).</li>
<li>Cross-reference (xref) capability: Search for callers of a given
function with <code>ext:who-calls</code>, and etc. Only works for bytecode
right now.</li>
<li>Support for Linux AARCH64.</li>
<li>LLVM17 support. LLVM15 and LLVM16 are still supported.</li>
</ul>
</div>
</div>

<div id="outline-container-org6a336a0" class="outline-3">
<h3 id="org6a336a0">Changed</h3>
<div class="outline-text-3" id="text-org6a336a0">
<ul class="org-ul">
<li>Improved printing of backquote and unquote.</li>
</ul>
</div>
</div>

<div id="outline-container-orge0d993c" class="outline-3">
<h3 id="orge0d993c">Fixed</h3>
<div class="outline-text-3" id="text-orge0d993c">
<ul class="org-ul">
<li>Avoid segmentation faults from incorrectly calling MP:PROCESS-JOIN
in EXT:RUN-PROGRAM.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc28254b" class="outline-2">
<h2 id="orgc28254b"><span class="timestamp-wrapper"><span class="timestamp">&lt;2023-06-04 Sun&gt; </span></span> Version 2.3.0 (LLVM15-16)</h2>
<div class="outline-text-2" id="text-orgc28254b">
</div>
