org/news.org
** Added
- Bytecode compiled images via build mode =:bytecode=.
- FASL magic number sniffing for CL:LOAD. This enables FASL files to
  be loaded even if the filename extension is incorrect.
- Preliminary Apple Silicon support. Must be compiled with bytecode
  either by specifying =--build-mode=bytecode= when invoking koga or
  by adding =:build-mode :bytecode= to the config.sexp file.
- LLVM16 support. LLVM15 is still supported.

** Changed
- Updated to Eclector v0.9.0

** Fixed
- Use Eclector state protocol to enable readtable changes during
  compiling.  Fixes [[https://github.com/clasp-developers/clasp/issues/1398][#1398]].

* <2023-03-01> Version 2.2.0 (LLVM15)

** Added
- =ext:describe-compiler-policy= to get information about the current
  behavior of the compiler.
- =gray:stream-line-length= Gray stream extension method.
- Support for building Clasp using CCL and ECL versus the default
  implementation of SBCL.
- Export of =ext:num-logical-processors= to return CPU count.

** Changed
- Updated to LLVM 15 and CLANG 15.

** Fixes
- Ensure that =print-unreadable-object= can accept output stream
  designators.
- Set stream column to zero after printing the prompt in a REPL. Fixes
  [[https://github.com/clasp-developers/clasp/issues/1348][#1348]].
- Return correct values for =listen= when applied to file
  streams. This is done by checking for available bytes using read
  when poll/select indicate the next read will not block. Otherwise
  use non-blocking read. Fixes [[https://github.com/clasp-developers/clasp/issues/1404][#1404]].
- Prevent format parameters from appearing after colon or at sign
  modifiers.
- Avoid putting NIL into simple LOOP when compiling format directives.

** Optimizations
- Arithmetic comparisons between floats and fixnums no longer cons.

* <2023-01-01> Version 2.1.0 (LLVM14)

** Added
- Add =ext:list-all-logical-hosts= and =ext:logical-host-p= functions
  to query the current logical host status.
- Operators for profiling CLOS code: =clos:with-profiling=

** Changed
- Removed stage and image format command line options (=-t= and =-T=)
  and replaced with options to specify image or snapshot file
  (=--image= or =--snapshot=) and =--base= option for loading base
  image when extensions are present.
- =print-unreadable-object= now prints qualified symbols for the
  =:type t= option and uses =pprint-logical-block= when pretty
  printing.
  
** Fixes
- =ext:run-program= works with string streams.
- =print-object= is now invoked for all calls to `write`.
- =slot-unbound= is called for unbound condition slots ([[https://github.com/clasp-developers/clasp/issues/1390][#1390]]).
- Multiple inheritance of class-allocated slots is resolved
  breadth-first ([[https://github.com/clasp-developers/clasp/issues/1392][#1392]]).

* <2022-10-26> Version 2.0.0 (LLVM14)

** Added
- Lisp based koga metabuilder that outputs Ninja build files.
- basic Debian packaging files.
- =core:*extension-systems*=, =core:*initialize-hooks*= and
  =core:*terminate-hooks= dynamic variables have been added to support new
  extension loading method. =core:*extension-systems*= is a list of keywords
  that name extension systems to load after Clasp starts and before =--load=
  and =--eval= command line options are processed. The remaining two variables
  are lists of functions that are called to do initialization before a REPL is
  started and termination after the REPL exits.
- =--script <file>= command line option which equivalent to passing =--norc=,
  =--noinform= and =--non-interactive=. Any shebang in =<file>= will also be 
  skipped.
- Asynchronous external process control with =ext:run-program=.
- Function =ext:temporary-directory= that returns the directory used for
  temporary files.
- Function =ext:printing-char-p= that returns non-NIL for graphic characters
  that are not blank glyphs. This is an extension of the ANSI specification
  that defines "printing" characters as graphic characters aside from the space
  character.

** Changed
- =core:lisp-implementation-id= and =core:clasp-git-full-commit= only return
  non-=NIL= values if Clasp was built in a git working tree.
- =graphic-char-p=, =alpha-char-p=, =alphanumericp=, =upper-case-p=, 
  =lower-case-p=, =both-case-p=, =char-upcase= and =char-downcase= now no longer 
  depend on C++ locale functions and are now generated directly from the Unicode 
  character tables.
- Loading of extensions such as Cando no longer uses startup scripts via LOAD.
  Instead the systems associated with each extension are loaded via QL:QUICKLOAD
  or as a fallback ASDF:LOAD-SYSTEM.
- Behavior of =--rc= command line option has changed. Relative paths passed via
  this option are no longer assumed to be located in the user's home directory.
- The logical hosts used by Clasp to locate source code and other components of
  Clasp has been changed. Only the reserved logical host SYS is now used. The
  default mappings for a system installed to =/usr/= are
  1. =SYS:LIB;**;*.*.*= ↦ =/usr/lib/clasp/**/*.*=
  2. =SYS:GENERATED;**;*.*.*= ↦ =/usr/share/clasp/generated/**/*.*=
  3. =SYS:EXECUTABLE;**;*.*.*= ↦ =/usr/bin/**/*.*=
  4. =SYS:QUICKLISP;**;*.*.*= ↦ =~/quicklisp/**/*.*=
  5. =SYS:**;*.*.*= ↦ =/usr/share/clasp/**/*.*=
- ASDF systems that are loaded as part the cclasp image are now marked as
  immutable thereby preventing ASDF from overwriting them. These systems include
  the systems acclimation, alexandria, clasp-cleavir, cleavir-ast-to-bir, 
  cleavir-ast, cleavir-ast-transformations, cleavir-attributes, cleavir-bir, 
  cleavir-bir-transformations, cleavir-compilation-policy, cleavir-conditions,
  cleavir-cst-to-ast, cleavir-ctype, cleavir-environment, 
  cleavir-io,cleavir-meter, cleavir-primop, cleavir-set, cleavir-stealth-mixins, 
  closer-mop, concrete-syntax-tree, concrete-syntax-tree-base,
  concrete-syntax-tree-destructuring, concrete-syntax-tree-lambda-list,
  eclector, and eclector-concrete-syntax-tree.
- Source code file references for Lisp and C/C++ files compiled as part of the
  Clasp binary or images are now stored using logical pathnames.
- Unicode character database updated to 2022-08-03.

