news.html
<div id="outline-container-org889ec92" class="outline-3">
<h3 id="org889ec92">Added</h3>
<div class="outline-text-3" id="text-org889ec92">
<ul class="org-ul">
<li>Bytecode compiled images via build mode <code>:bytecode</code>.</li>
<li>FASL magic number sniffing for CL:LOAD. This enables FASL files to
be loaded even if the filename extension is incorrect.</li>
<li>Preliminary Apple Silicon support. Must be compiled with bytecode
either by specifying <code>--build-mode=bytecode</code> when invoking koga or
by adding <code>:build-mode :bytecode</code> to the config.sexp file.</li>
<li>LLVM16 support. LLVM15 is still supported.</li>
</ul>
</div>
</div>

<div id="outline-container-org6555c55" class="outline-3">
<h3 id="org6555c55">Changed</h3>
<div class="outline-text-3" id="text-org6555c55">
<ul class="org-ul">
<li>Updated to Eclector v0.9.0</li>
</ul>
</div>
</div>

<div id="outline-container-orgfcaa864" class="outline-3">
<h3 id="orgfcaa864">Fixed</h3>
<div class="outline-text-3" id="text-orgfcaa864">
<ul class="org-ul">
<li>Use Eclector state protocol to enable readtable changes during
compiling.  Fixes <a href="https://github.com/clasp-developers/clasp/issues/1398">#1398</a>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org88efc3d" class="outline-2">
<h2 id="org88efc3d"><span class="timestamp-wrapper"><span class="timestamp">&lt;2023-03-01 Wed&gt; </span></span> Version 2.2.0 (LLVM15)</h2>
<div class="outline-text-2" id="text-org88efc3d">
</div>
<div id="outline-container-org3cbfa9f" class="outline-3">
<h3 id="org3cbfa9f">Added</h3>
<div class="outline-text-3" id="text-org3cbfa9f">
<ul class="org-ul">
<li><code>ext:describe-compiler-policy</code> to get information about the current
behavior of the compiler.</li>
<li><code>gray:stream-line-length</code> Gray stream extension method.</li>
<li>Support for building Clasp using CCL and ECL versus the default
implementation of SBCL.</li>
<li>Export of <code>ext:num-logical-processors</code> to return CPU count.</li>
</ul>
</div>
</div>

<div id="outline-container-org93e133f" class="outline-3">
<h3 id="org93e133f">Changed</h3>
<div class="outline-text-3" id="text-org93e133f">
<ul class="org-ul">
<li>Updated to LLVM 15 and CLANG 15.</li>
</ul>
</div>
</div>

<div id="outline-container-org20d2c4a" class="outline-3">
<h3 id="org20d2c4a">Fixes</h3>
<div class="outline-text-3" id="text-org20d2c4a">
<ul class="org-ul">
<li>Ensure that <code>print-unreadable-object</code> can accept output stream
designators.</li>
<li>Set stream column to zero after printing the prompt in a REPL. Fixes
<a href="https://github.com/clasp-developers/clasp/issues/1348">#1348</a>.</li>
<li>Return correct values for <code>listen</code> when applied to file
streams. This is done by checking for available bytes using read
when poll/select indicate the next read will not block. Otherwise
use non-blocking read. Fixes <a href="https://github.com/clasp-developers/clasp/issues/1404">#1404</a>.</li>
<li>Prevent format parameters from appearing after colon or at sign
modifiers.</li>
<li>Avoid putting NIL into simple LOOP when compiling format directives.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb7740f1" class="outline-3">
<h3 id="orgb7740f1">Optimizations</h3>
<div class="outline-text-3" id="text-orgb7740f1">
<ul class="org-ul">
<li>Arithmetic comparisons between floats and fixnums no longer cons.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2eb51a4" class="outline-2">
<h2 id="org2eb51a4"><span class="timestamp-wrapper"><span class="timestamp">&lt;2023-01-01 Sun&gt; </span></span> Version 2.1.0 (LLVM14)</h2>
<div class="outline-text-2" id="text-org2eb51a4">
</div>
<div id="outline-container-orgc8850ed" class="outline-3">
<h3 id="orgc8850ed">Added</h3>
<div class="outline-text-3" id="text-orgc8850ed">
<ul class="org-ul">
<li>Add <code>ext:list-all-logical-hosts</code> and <code>ext:logical-host-p</code> functions
to query the current logical host status.</li>
<li>Operators for profiling CLOS code: <code>clos:with-profiling</code></li>
</ul>
</div>
</div>

<div id="outline-container-org71a553c" class="outline-3">
<h3 id="org71a553c">Changed</h3>
<div class="outline-text-3" id="text-org71a553c">
<ul class="org-ul">
<li>Removed stage and image format command line options (<code>-t</code> and <code>-T</code>)
and replaced with options to specify image or snapshot file
(<code>--image</code> or <code>--snapshot</code>) and <code>--base</code> option for loading base
image when extensions are present.</li>
<li><code>print-unreadable-object</code> now prints qualified symbols for the
<code>:type t</code> option and uses <code>pprint-logical-block</code> when pretty
printing.</li>
</ul>
</div>
</div>

<div id="outline-container-org92697ed" class="outline-3">
<h3 id="org92697ed">Fixes</h3>
<div class="outline-text-3" id="text-org92697ed">
<ul class="org-ul">
<li><code>ext:run-program</code> works with string streams.</li>
<li><code>print-object</code> is now invoked for all calls to `write`.</li>
<li><code>slot-unbound</code> is called for unbound condition slots (<a href="https://github.com/clasp-developers/clasp/issues/1390">#1390</a>).</li>
<li>Multiple inheritance of class-allocated slots is resolved
breadth-first (<a href="https://github.com/clasp-developers/clasp/issues/1392">#1392</a>).</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb40899b" class="outline-2">
<h2 id="orgb40899b"><span class="timestamp-wrapper"><span class="timestamp">&lt;2022-10-26 Wed&gt; </span></span> Version 2.0.0 (LLVM14)</h2>
<div class="outline-text-2" id="text-orgb40899b">
</div>
<div id="outline-container-org1c3bf7f" class="outline-3">
<h3 id="org1c3bf7f">Added</h3>
<div class="outline-text-3" id="text-org1c3bf7f">
<ul class="org-ul">
<li>Lisp based koga metabuilder that outputs Ninja build files.</li>
<li>basic Debian packaging files.</li>
<li><code>core:*extension-systems*</code>, <code>core:*initialize-hooks*</code> and
<code>core:*terminate-hooks</code> dynamic variables have been added to support new
extension loading method. <code>core:*extension-systems*</code> is a list of keywords
that name extension systems to load after Clasp starts and before <code>--load</code>
and <code>--eval</code> command line options are processed. The remaining two variables
are lists of functions that are called to do initialization before a REPL is
started and termination after the REPL exits.</li>
<li><code>--script &lt;file&gt;</code> command line option which equivalent to passing <code>--norc</code>,
<code>--noinform</code> and <code>--non-interactive</code>. Any shebang in <code>&lt;file&gt;</code> will also be 
skipped.</li>
<li>Asynchronous external process control with <code>ext:run-program</code>.</li>
<li>Function <code>ext:temporary-directory</code> that returns the directory used for
temporary files.</li>
<li>Function <code>ext:printing-char-p</code> that returns non-NIL for graphic characters
that are not blank glyphs. This is an extension of the ANSI specification
that defines "printing" characters as graphic characters aside from the space
character.</li>
</ul>
</div>
</div>

<div id="outline-container-org0c0cb20" class="outline-3">
<h3 id="org0c0cb20">Changed</h3>
<div class="outline-text-3" id="text-org0c0cb20">
<ul class="org-ul">
<li><code>core:lisp-implementation-id</code> and <code>core:clasp-git-full-commit</code> only return
non-<code>NIL</code> values if Clasp was built in a git working tree.</li>
<li><code>graphic-char-p</code>, <code>alpha-char-p</code>, <code>alphanumericp</code>, <code>upper-case-p</code>, 
<code>lower-case-p</code>, <code>both-case-p</code>, <code>char-upcase</code> and <code>char-downcase</code> now no longer 
depend on C++ locale functions and are now generated directly from the Unicode 
character tables.</li>
<li>Loading of extensions such as Cando no longer uses startup scripts via LOAD.
Instead the systems associated with each extension are loaded via QL:QUICKLOAD
or as a fallback ASDF:LOAD-SYSTEM.</li>
<li>Behavior of <code>--rc</code> command line option has changed. Relative paths passed via
this option are no longer assumed to be located in the user's home directory.</li>
<li>The logical hosts used by Clasp to locate source code and other components of
Clasp has been changed. Only the reserved logical host SYS is now used. The
default mappings for a system installed to <code>/usr/</code> are
<ol class="org-ol">
<li><code>SYS:LIB;**;*.*.*</code> ↦ <code>/usr/lib/clasp/**/*.*</code></li>
<li><code>SYS:GENERATED;**;*.*.*</code> ↦ <code>/usr/share/clasp/generated/**/*.*</code></li>
<li><code>SYS:EXECUTABLE;**;*.*.*</code> ↦ <code>/usr/bin/**/*.*</code></li>
<li><code>SYS:QUICKLISP;**;*.*.*</code> ↦ <code>~/quicklisp/**/*.*</code></li>
<li><code>SYS:**;*.*.*</code> ↦ <code>/usr/share/clasp/**/*.*</code></li>
</ol></li>
<li>ASDF systems that are loaded as part the cclasp image are now marked as
immutable thereby preventing ASDF from overwriting them. These systems include
the systems acclimation, alexandria, clasp-cleavir, cleavir-ast-to-bir, 
cleavir-ast, cleavir-ast-transformations, cleavir-attributes, cleavir-bir, 
cleavir-bir-transformations, cleavir-compilation-policy, cleavir-conditions,
cleavir-cst-to-ast, cleavir-ctype, cleavir-environment, 
cleavir-io,cleavir-meter, cleavir-primop, cleavir-set, cleavir-stealth-mixins, 
closer-mop, concrete-syntax-tree, concrete-syntax-tree-base,
concrete-syntax-tree-destructuring, concrete-syntax-tree-lambda-list,
eclector, and eclector-concrete-syntax-tree.</li>
<li>Source code file references for Lisp and C/C++ files compiled as part of the
Clasp binary or images are now stored using logical pathnames.</li>
<li>Unicode character database updated to 2022-08-03.</li>
</ul>
</div>
</div>
