org/news.org
** Removed
- =core:*extensions-startup-loads*= and =core:*extensions-startup-evals*=
  dynamic variables have been removed since they are no longer used.
- The =--resources-dir= command line option has been removed. Equivalent
  behavior is achieved with the =CLASP_HOME= environment variable.

** Enhancements
- =make-instance= and CLOS slot access functions can be used with structure 
  objects.
- The stepper, accessible through =step=, now has basic functionality.
- =gctools:save-lisp-and-die= now accepts a key =:executable= which can be used
  to create an executable binary with the snapshot embedded in the binary.
- =garbage-collect=, =finalize=, and =save-lisp-and-die= are now exported from
  the =ext= interface package.

** Optimizations
- Arguments to and return values from local functions (e.g. from FLET) are 
  passed unboxed in some common cases.
- Nonlocal exits are much faster in most cases, the exception being when
  the exit goes through uncooperative C++ code.
- Types inferred for many standard functions are tighter.
- Calls to some local functions with &rest parameters are more efficient.
- LENGTH is now a "vaslistable" function; &rest parameters that are only
  used for vaslistable functions can be compiled to avoid consing.
- Multiple value calls and APPLY calls to known functions can sometimes
  be optimized.
- Some MAKE-ARRAY calls are compiled more efficiently.
- Unused calls to many more (side-effect-free) standard functions are deleted.
- Accesses to 1D simple arrays of known element type are a bit faster.
- A virtual machine has been defined and implemented, greatly increasing the
  speed of evaluation of code that doesn't usually need to be optimized
  (for example, compile-time evaluations).
- The building process has been streamlined by replacing several of the
  bootstrapping components with the virtual machine.
- Discriminating functions now execute faster.
- The compiler now performs inlining much faster.

** Fixes
+ Replace hard coded paths to =nm= in snapshot code with =NM_BINARY= macro value
  set by configure.
+ Clasp can now be built directly from source. Resolves [[https://github.com/clasp-developers/clasp/issues/175][issue #175]].
+ Snapshots now parse command line options such as =--noinform=, =--noprint=,
  =--quit=, and =--disable-debugger=.
+ Source locations for warnings from errors during constant folding now
  print correctly.
+ Unused calls that must remain in safe code are no longer deleted.
+ Prevent negative zero remainder in =core__next_ftruncate=. Fixes [[https://github.com/clasp-developers/clasp/issues/1368][#1368]].

* <2021-05-25> Version 1.0
- Clasp has the ability to save and restart from memory snapshots.
- Clasp supports the addition of extensions written in C++ by adding them to the extensions directory.
  The extensions integrate with the clasp build system.
- The Clasp Cleavir compiler now uses basic blocks to do many new optimizations.
- A multithreaded compiler that compiles abstract-syntax-trees to native code in multiple threads. It speeds up compilation by a factor of 2-3x.


* <2015-11-20> Version 0.4
-  Clasp has a completely new, optimizing/inlining compiler based on Cleavir.
-  Fixnum, character and single-float types are immediate values.
-  General object pointers and cons pointers are tagged for speed.
-  Lots of bug fixes and stability improvements.
