news.html

<div id="outline-container-org0bbdf80" class="outline-3">
<h3 id="org0bbdf80">Removed</h3>
<div class="outline-text-3" id="text-org0bbdf80">
<ul class="org-ul">
<li><code>core:*extensions-startup-loads*</code> and <code>core:*extensions-startup-evals*</code>
dynamic variables have been removed since they are no longer used.</li>
<li>The <code>--resources-dir</code> command line option has been removed. Equivalent
behavior is achieved with the <code>CLASP_HOME</code> environment variable.</li>
</ul>
</div>
</div>

<div id="outline-container-orge13c5c3" class="outline-3">
<h3 id="orge13c5c3">Enhancements</h3>
<div class="outline-text-3" id="text-orge13c5c3">
<ul class="org-ul">
<li><code>make-instance</code> and CLOS slot access functions can be used with structure 
objects.</li>
<li>The stepper, accessible through <code>step</code>, now has basic functionality.</li>
<li><code>gctools:save-lisp-and-die</code> now accepts a key <code>:executable</code> which can be used
to create an executable binary with the snapshot embedded in the binary.</li>
<li><code>garbage-collect</code>, <code>finalize</code>, and <code>save-lisp-and-die</code> are now exported from
the <code>ext</code> interface package.</li>
</ul>
</div>
</div>

<div id="outline-container-org3b41c1c" class="outline-3">
<h3 id="org3b41c1c">Optimizations</h3>
<div class="outline-text-3" id="text-org3b41c1c">
<ul class="org-ul">
<li>Arguments to and return values from local functions (e.g. from FLET) are 
passed unboxed in some common cases.</li>
<li>Nonlocal exits are much faster in most cases, the exception being when
the exit goes through uncooperative C++ code.</li>
<li>Types inferred for many standard functions are tighter.</li>
<li>Calls to some local functions with &amp;rest parameters are more efficient.</li>
<li>LENGTH is now a "vaslistable" function; &amp;rest parameters that are only
used for vaslistable functions can be compiled to avoid consing.</li>
<li>Multiple value calls and APPLY calls to known functions can sometimes
be optimized.</li>
<li>Some MAKE-ARRAY calls are compiled more efficiently.</li>
<li>Unused calls to many more (side-effect-free) standard functions are deleted.</li>
<li>Accesses to 1D simple arrays of known element type are a bit faster.</li>
<li>A virtual machine has been defined and implemented, greatly increasing the
speed of evaluation of code that doesn't usually need to be optimized
(for example, compile-time evaluations).</li>
<li>The building process has been streamlined by replacing several of the
bootstrapping components with the virtual machine.</li>
<li>Discriminating functions now execute faster.</li>
<li>The compiler now performs inlining much faster.</li>
</ul>
</div>
</div>

<div id="outline-container-orgce1b96c" class="outline-3">
<h3 id="orgce1b96c">Fixes</h3>
<div class="outline-text-3" id="text-orgce1b96c">
<ul class="org-ul">
<li>Replace hard coded paths to <code>nm</code> in snapshot code with <code>NM_BINARY</code> macro value
set by configure.</li>
<li>Clasp can now be built directly from source. Resolves <a href="https://github.com/clasp-developers/clasp/issues/175">issue #175</a>.</li>
<li>Snapshots now parse command line options such as <code>--noinform</code>, <code>--noprint</code>,
<code>--quit</code>, and <code>--disable-debugger</code>.</li>
<li>Source locations for warnings from errors during constant folding now
print correctly.</li>
<li>Unused calls that must remain in safe code are no longer deleted.</li>
<li>Prevent negative zero remainder in <code>core__next_ftruncate</code>. Fixes <a href="https://github.com/clasp-developers/clasp/issues/1368">#1368</a>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org532a7c1" class="outline-2">
<h2 id="org532a7c1"><span class="timestamp-wrapper"><span class="timestamp">&lt;2021-05-25 Tue&gt; </span></span> Version 1.0</h2>
<div class="outline-text-2" id="text-org532a7c1">
<ul class="org-ul">
<li>Clasp has the ability to save and restart from memory snapshots.</li>
<li>Clasp supports the addition of extensions written in C++ by adding them to the extensions directory.
The extensions integrate with the clasp build system.</li>
<li>The Clasp Cleavir compiler now uses basic blocks to do many new optimizations.</li>
<li>A multithreaded compiler that compiles abstract-syntax-trees to native code in multiple threads. It speeds up compilation by a factor of 2-3x.</li>
</ul>
</div>
</div>


<div id="outline-container-orgac2eff9" class="outline-2">
<h2 id="orgac2eff9"><span class="timestamp-wrapper"><span class="timestamp">&lt;2015-11-20 Fri&gt; </span></span> Version 0.4</h2>
<div class="outline-text-2" id="text-orgac2eff9">
<ul class="org-ul">
<li>Clasp has a completely new, optimizing/inlining compiler based on Cleavir.</li>
<li>Fixnum, character and single-float types are immediate values.</li>
<li>General object pointers and cons pointers are tagged for speed.</li>
<li>Lots of bug fixes and stability improvements.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<center><p>
<a href="sitemap.html">Sitemap</a> &#x2014; <a href="license.html">License</a>
</p>
</center>
</div>
</body>
</html>
